# 2) შექმენით 10 ელემენტიანი list'ი და კომენტარის სახით დანომრეთ (მიუწერეთ ინდექსები). შემდეგ კი უბრალოდ გამოიტანეთ ეკრანზე.
# 3) პირველ დავალებაში შექმნილი List'იდან გამოიტანეთ პირველი სამი, ბოლო სამი და შუა 4 დადებითი ინდექსებით. (slicing)
# 4) პირველ დავალებაში შექმნილი List'იდან გამოიტანეთ პირველი სამი, ბოლო სამი და შუა 4 უარყოფითი ინდექსებით. (slicing)
# 5) შექმენით სტრინგი და შეატრიალეთ მისი სიმბოლოები ანუ თუ თავიდან იქნებოდა "Hello" გახდეს "olleH"

#პირველი დავალება

#      -10 -9 -8 -7 -6 -5 -4 -3 -2 -1
list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
#       0  1  2  3  4  5  6  7  8  9
print(list)

#მეორე დავალება
print(list[:3])
print(list[7:])
print(list[3:7])

#მესამე დავალება
print(list[:-7])
print(list[-3:])
print(list[-7:-3])

x = "world"
print(x[::-1])