# 1) შექმენით ფუნქცია რომელიც ტერმინალში გამოიტანს goodbye world'ს
# 2) შექმენით ფუნქცია რომელიც არგუმენტად მიიღებს სახელს და გამოიტანს დამშვიდობებას
# 3) შექმენით ფუნქცია რომელიც არგუმენტად მიიღებს 2 რიცხვს და გამოიტანს მათ ჯამს
# 4) შექმენით ფუნქცია რომელიც არგუმენტად მიიღებს list'ს და გამოიტანს პირველ 3 რიცხვს


#პირველი დავალება
def goodbye():
    print("goodbye world")

goodbye()

#მეორე დავალება
def name(name):
    print("goodbye" + name)

name("mevludi")


#მესამე დავალება
def numbers(x,y):
    print(x + y)


numbers(6,10)

#მეოთხე დავალება
def autput3(list1):
    print(list1[:3])

autput3([10,20,30,40,50])