// 1) შექმენით 2 cw ფოლდერი Classwork ფოლდერში
// 2) დაიწყეთ პირველ ფოლდერში მუშაობა:

// a) გაუშვით npm init და შექმენით package.json
// b) package.json'ში დაამატეთ ახალი property სახელად type და მიანიჭეთ მნიშვნელობა commonjs
// c) შექმენით 2 js ფაილი, ერთში შექმენით 2 ფუნქცია და ამ ფაილიდან module.exports'ის მეშვეობით გამოიტანეთ ორივე ფუნქცია და require ფუნქციის მეშვეობით ჩასვით მეორე ფაილში
// d) გამოიძახეთ ეს ფუნქციები მეორე ფაილში და ნახეთ თუ სწორად მუშაობს 
// 3) დაიწყეთ მეორე ფოლდერში მუშაობა:

// a) გაუშვით npm init და შექმენით package.json
// b) package.json'ში დაამატეთ ახალი property სახელად type და მიანიჭეთ მნიშვნელობა module
// c) შექმენით 2 js ფაილი, ერთში შექმენით 3 ფუნქცია და ამ ფაილიდან 2 ფუნქცია გამოიტანეთ named export'ის მეშვეობით ხოლო მესამე default export'ის მეშვეობით და import'ის საშუალებით ჩასვით მეორე ფაილში სამივე ფუნქცია
// d) გამოიძახეთ ეს ფუნქციები მეორე ფაილში და ნახეთ თუ სწორად მუშაობს

function Hello() {
    console.log("Hello world!")
}

function Goodbye() {
    console.log("Goodbye world!")
}


export { Hello, Goodbye };
