// ES6  გამოვიდა 2015 წელს JavaScript'ის შექმნიდან 20 წლის შემდეგ მისი დამატების შემდეგ JavaScript'ში დაემატა ცვლადის შესაქმნელად
// გამოსაყენებელი კეივორდები როგორებიცაა let, const ასევე დაემატა loop'ის გამარტივებული ვერსია როლის მეშვეობიდაც უფრო მარტივად
// და მცირე დროში შეგვიძლია კოდის დაწერა ასევე ვამცირებთ კოდის რაოდენობასაც ამათ გარდა კიდევ დაემატა კლასები ...

// let და const კეივორდები var კეივორდს ჯობია იმით რომ ვარ ქეივორდი "არემორჩილება წესებს" ანუ თუ მას შევქმნით კოდის ბლოკში 
// მას შეუძლია კოდის ბლოკიდან გამოსვალ და მისი გამოყენება შეგვიძლია კოდის ბლოკის გარეთაც ხოლო let და const კეივორდებს 
// ეს მინუსი არაქვსთ

const cars = ["BMW", "Volvo", "Mini", "Mercedes"];
for (let i of cars) {
    console.log(i);
}


const numbers = [45, 4, 9, 16, 25];

let text = "";
for (let i in numbers) {
  text += numbers[i];
  console.log(text)
}

const sum = (a, b) => a * b;
console.log(sum(10, 5));

const obj1 = {
    name: "mevludi",
    lastname: "tavadze",
    age: 16,
};

const obj2 = {
    name: "luka",
    lastname: "leladze"
};

console.log(Object.assign({}, obj1, obj2))

// Object.assign() რამდენიმე ობიექტის კეიებს და მათ ველიუებს იღებს ქმნის ან რომელიმე ობიექტის მნიშვნელობებს ანახლებს "ეს ჩვენზეა
// დამოკიდებული" და გამოაქვს ჩვენი მითითებული ობიექტების შერწყმული ვერსია