// Document Object Model (DOM) არის პროგრამირების ინტერფეისი ვებ დოკუმენტებისთვის.
// ის წარმოადგენს გვერდს ისე, რომ პროგრამებს შეუძლიათ შეცვალონ დოკუმენტის სტრუქტურა, სტილი და შინაარსი. 
// DOM წარმოადგენს დოკუმენტს კვანძებად და ობიექტებად ამ გზით პროგრამირების ენებს შეუძლიათ ურთიერთქმედება გვერდზე.


// console საშუალებას აძლევს დეველოპერს ნახოს და დაუკავშირდეს JavaScript-ის შეცდომებს 
// დაწეროს შეტყობინებები და გაუშვას კოდის პირდაპირ ბრაუზერში ისე რომ დაწერილი კოდი არ აგვერევა იგი ასევე გვეხმარება  პრობლემების 
// აღმოჩენაში და მის გამოსწორებაში 

// let keyword გვეხმარება იმაში რომ დავადეკლარიორთ(შევქმნათ) ცვლადი JavaScript'ში


let Num1 = 5;
let Num2 = 10;

console.log(Num1 + Num2);