# list არის mutable  ანუ შეგვიძლია მისი შეცვლა ლისტში შეგვიძლია დავამატოთ ელემენტი ინდექსის საშუალებით და ასევე ამოვაგდოთ
#list გააჩინია ინდექსები 

#tuple არის immutable ანუ მისი შეცვლა არშეგვიძლია მას list'ის მსგავსად გააჩნია ინდექსები და ასევე შეგვიძლია შევინახოთ ნებისმიერი 
#ტიპის ელემენტი როგორც list'ში მაგრამ tuple'ში არ შეგვიძლია დავამატოთ და ამოვაგდოთ ელემენტები 

#set არის mutable ანუ list'ის მსგავსად მისიშეცვლა შეგვიძლია მაგრამ მას არ გააჩნია ინდექსები  ისიც list'ისა და tuples მსგავსად ინახავს
#ნებისმიერი ტიპის ელემენტს set'ს ასევერ არ გააჩნია დუპლიკატი ანუ ერთნაირი ელემენტი რამდენჯერაც არ უნდა ჩავწეროთ შიგნით მაინც მხოლოდ
#ერთხელ გამოიტანს set'ში შეგვიძლია ჩავამატოთ და ამოვაკლოთ ელემენტები მისი სახელის საშუალებით