# 1) ახსენით რა არის კომპოზიცია, რითი განსხვავდება აგრეგაციისგან და გააკეთეთ 1 მაგალითი
# 2) განიხილეთ instance, static და class მეთოდები და გააკეთეთ სამივეს მაგალითი
# 3) გაიხსენეთ და ახსენით რა არის multiple და multilevel inheritance


# multipe inheritence არის როდესაც ჩაილდ ელემენტი იღებს ერთ ფერენთ ელემენტს შემდეგ ჩაილდ ყავს თავის ჩაილდ ელემენტი ...
# multilevel inheritance არის როდესაც ჩაილდ ელემენტს შეუძლია მიიღოს ერთი ან ერთზე მეტი ფერენთ ელემენტი


# კომპოზიციის დროს ჩვენი კლასები ერთმანეთთან არის დაკავშირებული ისე რომ თუ მათ რომელიმე კოდს წავუშლით ჩვენი კოდი გამოიტანს 
# ერორს მოკლედ რომ ვთქვათ თითოეული კლასი ერთმანეთთან ბუნების ჯაჭვივით არის დაკავშირებული და ერთის წაშლა გამოიწვევს ყველაფრის არევას
# კომპოზიციისგან განსხვავებით აგრეგაციას თუ წავუშლით რომელიმე კლასს მაშინ ჩვენ კოდს მაინც შეეძლება დომუიკიდებალდ იმუშაოს
# ანუ ისინი ერთმანეთთან მჭიდროდ არ არიან დაკავშირებული.




# instance მეთოდი არის ჩვეულებრივი მეთოდი რომელიც ატრიბუტად იღებს self რაც მიუთითებს კონკრეტულს ობიექტს

class Human:
    def __init__(self, name):
        self.name = name

    def greet(self):
        return f"my name is {self.name}"


# static მეთოდი არის ჩვეულებრივი მეთოდი რომელიც კლასშია მოქცეული

class Math:
    def sumNums(a, b):
        return a + b
    

# class მეთოდი იღებს არგუმენტად cls' რაც მიუთითებს თავად კლასსზე

class Human:
    Human1 = "humans"

    def func1(cls):
        return f"we are {cls.Human1}"
    

#მოიყვანეთ მაგალითი რა შემთხვევაში დაგვჭირდება data hiding და გააკეთეთ მსგავსი რამ კოდით

# data hiding დაგვჭრდება მაშინ როდესაც მაგალითად ვრეგისტრირდებით რაიმე საიტზე და არგვინდა ჩვენი მონაცემები იყოს სხვებისთვისაც
# ხელმისაწვდომი წინააღმდეგ შემთხვევაში მოხდება ინფორმაციის გჟონვა რაც შემდეგ უკვე წარმოქმნის საფრთხეს 


class Register:
    def __init__(self, name, email, password):
        self.name = name
        self.__email = email
        self.__password = password

    def print_email(self):
        print(f"self.email")

    def print_password(self):
        print(f"{self.__password}")

human1 = Human("mevludi", 16)
print(human1.print_email())
print(human1.print_password())
