#data types: 
#string
#integer
#float
#boolean


# string'ი არის ნებისმიერი სიმბოლოების ერთობლიობა რომელიც ჩასმულია ბრჭყალებში
# მაგალითად:
# "abcd"
# "12345"


# integer'ი ქართულად ნიშნავს მთელ რიცხვს
# მაგალითად:
# 1
# 200
# 2000000


# float'ი ქართულად ნიშნავს წილად რიცხვს
# მაგალითად:
# 3.5
# 10.3


# boolean'ი არის მონაცემთა ტიპი, რომელსაც აქვს მხოლოდ 2  მნიშვნელობა True/False (მართალი ან ტყუილი)

# კონკატენაცია არის ორი სტრინგის შეერთება

#type()'ს მეშვეობით შეგვიძლია შევამოწმოთ თუ რა ტიპის არის ჩვენი ცვლადი 

#explicit conversion'ი არის როდესაც ცვლადს ჩვენით ვუცვლით მონაცემთა ტიპს ხოლო
#implicit  როდესაც თაავისით ეცვლება მონაცემთა ტიპი

# შედარების ოპერატორები >, <, =, <=, >=