# 1) string არის immutable ანუ შეუცვლელი და მისი შეცვლა არშეგვიძლია

# 2) replace() მეთოდი სტრინგს კიარ ცვლის არამედ ქმნის ახალ სტრინგს და გამოაქვს იმის გარეშე რისი შენაცვლებაც გვინდა 

# 3) არა რადგან სეტი იწერება ფიგურული ბრჩხილებით 

# 4) მე შევქმენი ფუნქცია არის არასწორი რადგან ჩვენ კიარ შევქმენით არამედ დავადეკლარირეთ ფუნქცია

# 5) დიახ python არის case sensetive'ი ენა 

# 6) ორი True'ს დამატება გამოიტანს 2 

# 7) "1_000_000" თუ გადავაქცევთ ინტეჯერად გამოიტანს 1000000 და არანაირ ერორს

# 8) ცარიელი ლისტი არის Falsey

# 9) დიახ ჩვენ შეგვიძლია ფუნქციაში შევქმნათ ფუნქცია 

# 10) ZeroDivisionError ესეთი ერორი არსებობს რადგან ნულზე გაყოფა შეუძლებელია 

